class EmailClassifier:
    def __init__(self, text: str):
        self.text = text.lower()
        self.original_text = text

        self.categories = {
            "Запросы на предоставление доступа": [
                "доступ", "права", "логин", "пароль", "верификация", "аккаунт",
                "авторизация", "войти", "вход"
            ],

            "Сообщения о внештатных ситуациях": [
                "ошибка", "не работает", "не запускается", "не открывается",
                "не могу войти", "недоступен", "зависает", "падает", "сбой",
                "критичный", "500", "не отвечает", "остановлена"
            ],

            "Вопросы по поводу оборудования": [
                "ноутбук", "мышь", "гарнитура", "принтер", "сканер",
                "обновление", "установка", "антивирус", "outlook", "zoom", "vpn",
                "программа", "система", "сервис"
            ],

            "Спам": [
                "выиграли", "победитель", "розыгрыш", "скидка", "подтвердите личность",
                "приз", "банковской карты", "акция", "ссылка", "cdn-service"
            ],

            "Кадровые вопросы": [
                "отпуск", "больничный", "оформление", "новый сотрудник",
                "выход на работу", "кадров", "нетрудоспособности",
                "график работы", "сотрудник приступает"
            ],

            "Информационные сообщения": [
                "дайджест", "мониторинг", "отчёт", "отчет", "приглашение",
                "демо", "созвон", "технические работы", "документ", "инструкция",
                "договор", "счёт", "акт", "оплата", "заявка", "закрывающие документы",
                "направляем", "прошу подтвердить", "реквизиты", "файл", "вложение"
            ]
        }

    def is_draft(self):
        text_lower = self.original_text.lower()
        has_sender = "от кого:" in text_lower or "from:" in text_lower
        has_recipient = "кому:" in text_lower or "to:" in text_lower
        if not has_sender or not has_recipient:
            return True
        return False

    def classify(self):
        for word in self.categories["Спам"]:
            if word in self.text:
                return "Спам"

        if self.is_draft():
            return "Черновик"

        for category, words in self.categories.items():
            if category == "Спам":
                continue
            for word in words:
                if word in self.text:
                    return category
        return "Прочее"